## Problem Statement

To create and perform operations on Pandas Dataframe using Failed bank Dataset.

In [1]:
import pandas as pd

In [2]:
# Read the data
data = pd.read_csv('failed_bank_dataset.csv')
print("Data read into dataframe!")
data

Data read into dataframe!

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund
0,Almena State Bank,Almena,KS,15426,Equity Bank,23-Oct-20,10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb",16-Oct-20,10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.",03-Apr-20,10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,14-Feb-20,10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,01-Nov-19,10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",27-Jul-01,6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,03-May-01,4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,02-Feb-01,4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,14-Dec-00,4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,13-Oct-00,4645

In [3]:
# Print the first five rows of the data
print("First five rows of the data:")
data.head(5)

First five rows of the data:

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund
0,Almena State Bank,Almena,KS,15426,Equity Bank,23-Oct-20,10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb",16-Oct-20,10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.",03-Apr-20,10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,14-Feb-20,10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,01-Nov-19,10534

In [4]:
# Print the last five rows of the data
print("Last five rows of the data:")
data.tail(5)

Last five rows of the data:

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",27-Jul-01,6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,03-May-01,4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,02-Feb-01,4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,14-Dec-00,4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,13-Oct-00,4645

In [5]:
# Print the number of rows and columns of the data
print("Number of Columns in the data:", len(data.columns))
print("Number of Rows in the data:", len(data))

Number of Columns in the data: 7
Number of Rows in the data: 563

In [6]:
# Print the column names of the data
print("Column names of the data:")
data.columns

Column names of the data:

Index(['Bank Name ', 'City ', 'State ', 'Cert ', 'Acquiring Institution ',
       'Closing Date ', 'Fund'],
      dtype='object')

In [7]:
# Print the data types of the data
print("Data types of the data:")
data.dtypes

Data types of the data:

Bank Name                 object
City                      object
State                     object
Cert                       int64
Acquiring Institution     object
Closing Date              object
Fund                       int64
dtype: object

In [8]:
# Print the summary statistics of the data
print("Summary statistics of the data:")
data.describe()

Summary statistics of the data:

              Cert           Fund
count    563.000000    563.000000
mean   31630.271758  10036.875666
std    16443.670177   1115.338358
min       91.000000   4645.000000
25%    20096.500000  10116.500000
50%    32165.000000  10257.000000
75%    35364.000000  10397.500000
max    58701.000000  10538.000000

In [9]:
# Print the number of unique values for each column
print("Number of unique values for each column:")
data.nunique()

Number of unique values for each column:

Bank Name                 546
City                      433
State                      44
Cert                      563
Acquiring Institution     297
Closing Date              258
Fund                      563
dtype: int64

In [10]:
# print the number of missing values for each column
print("Number of missing values for each column:")
data.isnull().sum()

Number of missing values for each column:

Bank Name                 0
City                      0
State                     0
Cert                      0
Acquiring Institution     0
Closing Date              0
Fund                      0
dtype: int64

In [11]:
# Print the number of rows where each column has missing values
print("Number of rows where each column has missing values:")
data.isnull().sum(axis=1).value_counts()

Number of rows where each column has missing values:

0    563
dtype: int64